## Load Libraries

In [2]:
import pandas as pd
import numpy as np

## Load Dataset

In [24]:
#
df = pd.read_csv("Cleaned_Students_Performance.csv")

## Data Exploration

In [8]:
df.head(10)

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score,average_score
0,0,group B,bachelor's degree,1,0,72,72,74,218,72.666667
1,0,group C,some college,1,1,69,90,88,247,82.333333
2,0,group B,master's degree,1,0,90,95,93,278,92.666667
3,1,group A,associate's degree,0,0,47,57,44,148,49.333333
4,1,group C,some college,1,0,76,78,75,229,76.333333
5,0,group B,associate's degree,1,0,71,83,78,232,77.333333
6,0,group B,some college,1,1,88,95,92,275,91.666667
7,1,group B,some college,0,0,40,43,39,122,40.666667
8,1,group D,high school,0,1,64,64,67,195,65.000000
9,0,group B,high school,0,0,38,60,50,148,49.333333

In [9]:
df.tail(10)

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score,average_score
990,1,group E,high school,0,1,86,81,75,242,80.666667
991,0,group B,some high school,1,1,65,82,78,225,75.000000
992,0,group D,associate's degree,0,0,55,76,76,207,69.000000
993,0,group D,bachelor's degree,0,0,62,72,74,208,69.333333
994,1,group A,high school,1,0,63,63,62,188,62.666667
995,0,group E,master's degree,1,1,88,99,95,282,94.000000
996,1,group C,high school,0,0,62,55,55,172,57.333333
997,0,group C,high school,0,1,59,71,65,195,65.000000
998,0,group D,some college,1,1,68,78,77,223,74.333333
999,0,group D,some college,0,0,77,86,86,249,83.000000

In [10]:
df.shape

(1000, 10)

## Create New Columns

In [13]:
# Total score (already exists, recalculate to show logic)
df["total_score"] = df["math_score"] + df["reading_score"] + df["writing_score"]

# Average score
df["average_score"] = df["total_score"] / 3

# Performance category
df["performance"] = np.where(df["average_score"] >= 60, "Good", "Needs Improvement")

## Filtering Data

In [20]:
filtered_df = df[
    (df["parental_level_of_education"] == "high school") &
    (df["average_score"] > 70
     )
]

filtered_df.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score,average_score,performance
12,0,group B,high school,1,0,65,81,73,219,73.000000,Good
16,1,group C,high school,1,0,88,89,86,263,87.666667,Good
47,0,group C,high school,1,0,66,71,76,213,71.000000,Good
49,1,group C,high school,1,1,82,84,82,248,82.666667,Good
53,1,group D,high school,1,0,88,78,75,241,80.333333,Good

## Grouping and Aggregation

In [21]:
grouped = df.groupby("gender")["average_score"].agg(["mean", "count"])
grouped

             mean  count
gender
0       69.569498    518
1       65.837483    482

In [22]:
df.groupby("lunch")["average_score"].agg(["mean", "count"])

            mean  count
lunch
0      62.199061    355
1      70.837209    645